Repository: codewithakbar/unik
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Ma’lumotlar
ru: Данные

source: Yangiliklar
ru: Новости

source: Batavsil...
ru: Подробнее

source: SO'NGI YANGILIKLAR
ru: ПОСЛЕДНИЕ НОВОСТИ

source: Oqish
ru: Чтение

source: O'qituvchilar
ru: Преподаватели

source: Faqultetlar
ru: Факультеты

source: Talabalar
ru: Студенты

source: Hamkor
ru: Партнер

source: Manzil
ru: Адрес

source: Universitet
ru: Университет

source: Abiturient
ru: Заявитель

source: Talim Resurslari
ru: Учебные ресурсы

source: Tarmoklar
ru: сети

source: Faoliyat
ru: Деятельность

source: Malumot uchut telefon
ru: Телефон для информации

source: Malumot uchun email qutisi
ru: Почтовый ящик для справки

source: Urganch RANCH Texnologiya Universiteti
ru: Технологический Университет РАНЧ

source: Yana yuqlash
ru: Загрузить еще
